tutorials/cfdemSolverPiso/ErgunTestCG/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;//0.01;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.005;//0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo 0.1;

//libs ( "libgroovyBC.so" );
libs ( "libfiniteVolumeCFDEM.so" );

functions
(

    probes
    {
        type        probes;
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );  
        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            (0 0 0.0001)
            (0 0 0.0026)
            (0 0 0.0051)
            (0 0 0.0076)
            (0 0 0.0101)
            (0 0 0.0126)
            (0 0 0.0151)
            (0 0 0.0176)
            (0 0 0.0201)
            (0 0 0.0226)
            (0 0 0.0251)
            (0 0 0.0276)
            (0 0 0.0301)
            (0 0 0.0326)
            (0 0 0.0351)
            (0 0 0.0375)
            (0 0 0.0401)
            (0 0 0.0426)
            (0 0 0.0451)
            (0 0 0.0476)
            (0 0 0.0529)
        );

        // Fields to be probed
        fields ( p U voidfraction volAverage_voidfraction);

        // Write at same frequency as fields
        outputControl   timeStep;//outputTime;
        outputInterval  1;
    }

    probes_inletFlux
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;   //outputTime;
        log             true;       // log to screen?
        valueOutput     true;       // Write values at run-time output times?
        source          patch;   // Type of face source:
        sourceName      inlet;         // faceZone name, see below
        operation       sum;
        fields
        (
            phi
        );
    }

    probes_outletFlux
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;   //outputTime;
        log             true;       // log to screen?
        valueOutput     true;       // Write values at run-time output times?
        source          patch;   // Type of face source:
        sourceName      outlet;         // faceZone name, see below
        operation       sum;
        fields
        (
            phi
        );
    }

    probes_wallFlux
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;   //outputTime;
        log             true;       // log to screen?
        valueOutput     true;       // Write values at run-time output times?
        source          patch;   // Type of face source:
        sourceName      wall;         // faceZone name, see below
        operation       sum;
        fields
        (
            phi
        );
    }
   /*pressureDrop
   {
     type patchAverage;
     functionObjectLibs
     (
         "libsimpleFunctionObjects.so"
     );
     verbose true;
     patches
     (
         inlet
         outlet
     );
     fields
     (
         p
     );
     factor  1;
   }*/
);
// ************************************************************************* //
